<a id='import'></a>
# 1. Import Data and Libraries

>1.1 Set ID

>1.2 Remove Duplicates (3)

In [1]:
import pandas as pd
import numpy as np
import seaborn as sea
import matplotlib.pyplot as plt
from sklearn.preprocessing import MinMaxScaler

### 1.1 Set ID and Import Data

In [2]:
df = pd.read_csv('cluster.csv')
df.index.name = 'BookingID' # set variable Name as the index of the dataframe
df

,Churn,Name,Longevity,Year_Birth,TypeTravel,RoomType,RewardPoints,Comfort,ReceptionSchedule,FoodDrink,...,Wifi,Amenities,Staff,OnlineBooking,PriceQuality,RoomSpace,CheckOut,Checkin,Cleanliness,BarService
BookingID,,,,,,,,,,,,,,,,,,,,,
0,churn,Ms. Nicole Clarke,yes,1974.0,business,single,4907,3,4,1,...,4,3,4,3,3,3,3,4,3,4
1,nochurn,Mr. Jesse Scott,yes,1965.0,business,single,6724,1,1,1,...,5,3,4,5,5,5,5,1,5,2
2,churn,Mr. Christopher Carter,yes,1973.0,business,single,4365,3,3,3,...,1,4,4,3,3,2,3,2,3,1
3,nochurn,Ms. Jennifer Morgan,yes,1993.0,leisure,double,3849,1,1,1,...,4,4,5,4,4,4,4,4,4,3
4,nochurn,Mr. Michael White,yes,1989.0,business,single,5376,2,2,3,...,5,5,5,5,5,3,4,1,3,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15584,churn,Ms. Wendy Roberts,no,1988.0,business,double,4968,2,0,2,...,3,2,4,3,4,5,1,3,4,3
15585,churn,Ms. Sonya Smith,no,2000.0,business,double,4970,3,3,3,...,5,3,5,5,3,1,3,4,4,5
15586,nochurn,Mr. Maxwell Wright,yes,1964.0,business,single,4046,1,1,1,...,3,4,5,4,4,4,4,5,4,4
15587,nochurn,Mr. Gregory Moran,yes,1992.0,leisure,double,5155,4,3,4,...,5,4,5,5,2,5,4,3,4,5
15588,churn,Mr. Steven Mendez,yes,1983.0,business,suite,5136,3,3,3,...,3,3,3,3,4,5,4,1,3,3

In [3]:
df.describe

<bound method NDFrame.describe of              Churn                    Name Longevity  Year_Birth TypeTravel  \
BookingID
0            churn       Ms. Nicole Clarke       yes      1974.0   business
1          nochurn         Mr. Jesse Scott       yes      1965.0   business
2            churn  Mr. Christopher Carter       yes      1973.0   business
3          nochurn     Ms. Jennifer Morgan       yes      1993.0    leisure
4          nochurn       Mr. Michael White       yes      1989.0   business
...            ...                     ...       ...         ...        ...
15584        churn       Ms. Wendy Roberts        no      1988.0   business
15585        churn         Ms. Sonya Smith        no      2000.0   business
15586      nochurn      Mr. Maxwell Wright       yes      1964.0   business
15587      nochurn       Mr. Gregory Moran       yes      1992.0    leisure
15588        churn       Mr. Steven Mendez       yes      1983.0   business

          RoomType  RewardPoints  Comfort  ReceptionSchedule  FoodDrink  ...  \
BookingID                                                                ...
0           single          4907        3                  4          1  ...
1           single          6724        1                  1          1  ...
2           single          4365        3                  3          3  ...
3           double          3849        1                  1          1  ...
4           single          5376        2                  2          3  ...
...            ...           ...      ...                ...        ...  ...
15584       double          4968        2                  0          2  ...
15585       double          4970        3                  3          3  ...
15586       single          4046        1                  1          1  ...
15587       double          5155        4                  3          4  ...
15588        suite          5136        3                  3          3  ...

           Wifi  Amenities  Staff  OnlineBooking  PriceQuality  RoomSpace  \
BookingID
0             4          3      4              3             3          3
1             5          3      4              5             5          5
2             1          4      4              3             3          2
3             4          4      5              4             4          4
4             5          5      5              5             5          3
...         ...        ...    ...            ...           ...        ...
15584         3          2      4              3             4          5
15585         5          3      5              5             3          1
15586         3          4      5              4             4          4
15587         5          4      5              5             2          5
15588         3          3      3              3             4          5

           CheckOut  Checkin  Cleanliness  BarService
BookingID
0                 3        4            3           4
1                 5        1            5           2
2                 3        2            3           1
3                 4        4            4           3
4                 4        1            3           5
...             ...      ...          ...         ...
15584             1        3            4           3
15585             3        4            4           5
15586             4        5            4           4
15587             4        3            4           5
15588             4        1            3           3

[15589 rows x 21 columns]>

### 1.2 Check for duplicates and drop them

In [4]:
df[df.duplicated(keep = False)]

,Churn,Name,Longevity,Year_Birth,TypeTravel,RoomType,RewardPoints,Comfort,ReceptionSchedule,FoodDrink,...,Wifi,Amenities,Staff,OnlineBooking,PriceQuality,RoomSpace,CheckOut,Checkin,Cleanliness,BarService
BookingID,,,,,,,,,,,,,,,,,,,,,
8194,nochurn,Ms. Abigail York,yes,1995.0,leisure,double,5098,5,5,5,...,4,5,5,3,3,4,3,3,3,5
8195,nochurn,Ms. Abigail York,yes,1995.0,leisure,double,5098,5,5,5,...,4,5,5,3,3,4,3,3,3,5
9175,churn,Ms. Abigail Kennedy,yes,1991.0,business,suite,5932,3,3,2,...,3,3,3,3,4,1,4,3,4,3
9176,churn,Ms. Abigail Kennedy,yes,1991.0,business,suite,5932,3,3,2,...,3,3,3,3,4,1,4,3,4,3
9416,nochurn,Ms. Abigail Buchanan,yes,1972.0,business,double,6769,5,4,4,...,5,5,4,5,5,5,5,2,5,1
9417,nochurn,Ms. Abigail Buchanan,yes,1972.0,business,double,6769,5,4,4,...,5,5,4,5,5,5,5,2,5,1

In [5]:
df.drop_duplicates(inplace = True)
df

,Churn,Name,Longevity,Year_Birth,TypeTravel,RoomType,RewardPoints,Comfort,ReceptionSchedule,FoodDrink,...,Wifi,Amenities,Staff,OnlineBooking,PriceQuality,RoomSpace,CheckOut,Checkin,Cleanliness,BarService
BookingID,,,,,,,,,,,,,,,,,,,,,
0,churn,Ms. Nicole Clarke,yes,1974.0,business,single,4907,3,4,1,...,4,3,4,3,3,3,3,4,3,4
1,nochurn,Mr. Jesse Scott,yes,1965.0,business,single,6724,1,1,1,...,5,3,4,5,5,5,5,1,5,2
2,churn,Mr. Christopher Carter,yes,1973.0,business,single,4365,3,3,3,...,1,4,4,3,3,2,3,2,3,1
3,nochurn,Ms. Jennifer Morgan,yes,1993.0,leisure,double,3849,1,1,1,...,4,4,5,4,4,4,4,4,4,3
4,nochurn,Mr. Michael White,yes,1989.0,business,single,5376,2,2,3,...,5,5,5,5,5,3,4,1,3,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15584,churn,Ms. Wendy Roberts,no,1988.0,business,double,4968,2,0,2,...,3,2,4,3,4,5,1,3,4,3
15585,churn,Ms. Sonya Smith,no,2000.0,business,double,4970,3,3,3,...,5,3,5,5,3,1,3,4,4,5
15586,nochurn,Mr. Maxwell Wright,yes,1964.0,business,single,4046,1,1,1,...,3,4,5,4,4,4,4,5,4,4
15587,nochurn,Mr. Gregory Moran,yes,1992.0,leisure,double,5155,4,3,4,...,5,4,5,5,2,5,4,3,4,5
15588,churn,Mr. Steven Mendez,yes,1983.0,business,suite,5136,3,3,3,...,3,3,3,3,4,5,4,1,3,3

### 2. Data Exploration

#### 2.1 Overview of the Data

In [6]:
df.shape

(15586, 21)

In [7]:
df.columns

Index(['Churn', 'Name', 'Longevity', 'Year_Birth', 'TypeTravel', 'RoomType',
       'RewardPoints', 'Comfort', 'ReceptionSchedule', 'FoodDrink', 'Location',
       'Wifi', 'Amenities', 'Staff', 'OnlineBooking', 'PriceQuality',
       'RoomSpace', 'CheckOut', 'Checkin', 'Cleanliness', 'BarService'],
      dtype='object')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15586 entries, 0 to 15588
Data columns (total 21 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Churn              15586 non-null  object
 1   Name               15586 non-null  object
 2   Longevity          15586 non-null  object
 3   Year_Birth         15391 non-null  float64
 4   TypeTravel         15586 non-null  object
 5   RoomType           15586 non-null  object
 6   RewardPoints       15586 non-null  int64
 7   Comfort            15586 non-null  int64
 8   ReceptionSchedule  15586 non-null  int64
 9   FoodDrink          15586 non-null  int64
 10  Location           15586 non-null  int64
 11  Wifi               15586 non-null  int64
 12  Amenities          15586 non-null  int64
 13  Staff              15586 non-null  int64
 14  OnlineBooking      15586 non-null  int64
 15  PriceQuality       15586 non-null  int64
 16  RoomSpace          15586 non-null  int64
 17  CheckOut           15586 non-null  int64
 18  Checkin            15586 non-null  int64
 19  Cleanliness        15586 non-null  int64
 20  BarService         15586 non-null  int64
dtypes: float64(1), int64(15), object(5)
memory usage: 2.6+ MB

Only the column Year_Birth has NaN values. All variables from the survey are integers, the year of birth is a float and the remaining variables are objects.

In [9]:
df.describe().T # All numeric variables

,count,mean,std,min,25%,50%,75%,max
Year_Birth,15391.0,1981.705607,15.179757,1936.0,1970.0,1981.0,1994.00,2014.0
RewardPoints,15586.0,5022.418581,1027.940126,409.0,4445.0,5088.0,5648.75,6950.0
Comfort,15586.0,2.841332,1.388541,0.0,2.0,3.0,4.00,5.0
ReceptionSchedule,15586.0,2.997049,1.519035,0.0,2.0,3.0,4.00,5.0
FoodDrink,15586.0,2.844412,1.436937,0.0,2.0,3.0,4.00,5.0
Location,15586.0,2.985821,1.299438,1.0,2.0,3.0,4.00,5.0
Wifi,15586.0,3.244963,1.327064,0.0,2.0,3.0,4.00,6.0
Amenities,15586.0,3.374631,1.352419,0.0,2.0,4.0,4.00,5.0
Staff,15586.0,3.506288,1.319625,1.0,3.0,4.0,5.00,5.0
OnlineBooking,15586.0,3.454190,1.310401,0.0,2.0,4.0,5.00,5.0
PriceQuality,15586.0,3.459579,1.268180,1.0,3.0,4.0,4.00,5.0
RoomSpace,15586.0,3.470871,1.293782,0.0,2.0,4.0,5.00,5.0
CheckOut,15586.0,3.700500,1.158693,1.0,3.0,4.0,5.00,5.0
Checkin,15586.0,3.327409,1.266944,1.0,3.0,3.0,4.00,5.0
Cleanliness,15586.0,3.692288,1.154484,1.0,3.0,4.0,5.00,5.0
BarService,15586.0,3.347427,1.300371,0.0,2.0,3.0,4.00,5.0

The Year_Birth variable has a maximum value of 2014 which might indicate a problem with that particular entry, because it would mean that a 8 year old would have done the booking.
The RewardsPoints variable has a vary high standard deviation and a very high range between the minimum and maximum values, therefore this variable must be standardized before applying the kmeans algorithm.
The Wifi variable has a maximum value of 6 which is an error because the maximum value allowed by the survey was a 5.

In [10]:
df.skew()

/var/folders/hs/t_th7f6j6tsb1fg2d7_808y80000gn/T/ipykernel_35886/1665899112.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.skew()

Year_Birth          -0.003724
RewardPoints        -0.453744
Comfort             -0.100806
ReceptionSchedule   -0.260518
FoodDrink           -0.123543
Location            -0.050057
Wifi                -0.171105
Amenities           -0.599424
Staff               -0.554468
OnlineBooking       -0.472109
PriceQuality        -0.503290
RoomSpace           -0.482872
CheckOut            -0.750667
Checkin             -0.382822
Cleanliness         -0.745109
BarService          -0.358340
dtype: float64

How to interpret the skewness:
- If the skewness is between -0.5 and 0.5, the data are fairly symmetrical
- If the skewness is between -1 and — 0.5 or between 0.5 and 1, the data are moderately skewed
- If the skewness is less than -1 or greater than 1, the data are highly skewed.


Amenities, Staff, PriceQuality, CheckOut and Cleanliness appear to have a moderate negative skewness.

In [11]:
df.kurt()

/var/folders/hs/t_th7f6j6tsb1fg2d7_808y80000gn/T/ipykernel_35886/1257127604.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.kurt()

Year_Birth          -0.729844
RewardPoints         0.260162
Comfort             -0.935490
ReceptionSchedule   -1.077415
FoodDrink           -0.967006
Location            -1.076634
Wifi                -1.111382
Amenities           -0.540790
Staff               -0.859138
OnlineBooking       -0.931961
PriceQuality        -0.772889
RoomSpace           -0.864568
CheckOut            -0.225208
Checkin             -0.812148
Cleanliness         -0.225374
BarService          -0.949633
dtype: float64

The variable with the highest kurtosis are ReceptionSchedule, Location, Wifi. RewardPoints variable has a positive kurtosis while its skewness statistic was negative.

In [12]:
df.describe(include = ['O']) # incluir as variáveis categóricas no describe

          Churn               Name Longevity TypeTravel RoomType
count     15586              15586     15586      15586    15586
unique        2              14227         3          2        3
top     nochurn  Mr. Michael Smith       yes   business   single
freq       8475                  9     12545      10754     7442

All categorical variable have no NaN values. 
There are 14.227 unique clients in the booking dataset, and the client that has used the Book Me services more often was Mr. Michael Smith with 9 bookings.
We have a problem with the Longevity variable, since it is a binary variable (yes or no) and there are 3 unique values in that variable.
It appears that the most common TypeTravel is the business travel and the RoomType that is booked the most is the single room.
Below we will inspect every variable in the dataset individually.

In [13]:
df['Churn'].value_counts()

nochurn    8475
churn      7111
Name: Churn, dtype: int64

No problems with this variable, we only need to turn it into a flag.

In [14]:
df['Name'].value_counts()

Mr. Michael Smith     9
Mr. John Smith        7
Ms. Amanda Smith      7
Mr. Michael Davis     6
Ms. Jennifer Smith    6
                     ..
Ms. Laurie Smith      1
Mr. Aaron Cox         1
Ms. Natasha Estes     1
Ms. Beverly Lee       1
Mr. Steven Mendez     1
Name: Name, Length: 14227, dtype: int64

Use this variable to create a new variable called Gender and then turn it into a flag.

In [15]:
df['Longevity'].value_counts()

yes    12545
no      2874
y        167
Name: Longevity, dtype: int64

Transform the "y" into "yes". Then transform the variable into a flag.

In [16]:
df['Year_Birth'].value_counts(ascending = True)

1936.0      2
1942.0      3
1943.0      6
1945.0      8
1947.0      9
         ...
1981.0    369
1998.0    380
1980.0    383
1996.0    416
1982.0    441
Name: Year_Birth, Length: 75, dtype: int64

Needs further investigation to know what to do with the entries made by children.

In [17]:
df['TypeTravel'].value_counts()

business    10754
leisure      4832
Name: TypeTravel, dtype: int64

No problems with this variable. Needs to be turned into a flag.

In [18]:
df['RoomType'].value_counts()

single    7442
double    7019
suite     1125
Name: RoomType, dtype: int64

No problems with this variable. Needs to be turned into a flag. To do that we must encode the variable into 2 columns.

In [19]:
df['RewardPoints'].value_counts()

5286    19
5010    17
5094    16
4942    16
5347    16
        ..
6666     1
3927     1
1766     1
4706     1
3304     1
Name: RewardPoints, Length: 4061, dtype: int64

This variable has a very high range and it must be normalized.

In [20]:
df['Comfort'].value_counts(ascending = True)

0     574
5    2100
1    2487
2    3452
4    3475
3    3498
Name: Comfort, dtype: int64

No problems with this variable.

In [21]:
df['ReceptionSchedule'].value_counts(ascending = True)

0     776
1    2484
2    2725
3    2797
5    3171
4    3633
Name: ReceptionSchedule, dtype: int64

No problems with this variable.

In [22]:
df['FoodDrink'].value_counts(ascending = True)

0     731
5    2353
1    2490
2    3282
4    3324
3    3406
Name: FoodDrink, dtype: int64

No problems with this variable.

In [23]:
df['Location'].value_counts(ascending = True)

5    2252
1    2687
2    2957
4    3606
3    4084
Name: Location, dtype: int64

No problems with this variable.

In [24]:
df['Wifi'].value_counts(ascending = True)

0      18
6      36
1    1792
2    3245
3    3347
5    3445
4    3703
Name: Wifi, dtype: int64

There are 36 input values with 6 selected. This value is not a valied and must be transformed into a number from 0 to 5.

In [25]:
df['Amenities'].value_counts(ascending = True)

0     376
1    1427
2    2307
3    2931
5    3583
4    4962
Name: Amenities, dtype: int64

No problems with this variable.

In [26]:
df['Staff'].value_counts(ascending = True)

1    1733
2    2107
3    2598
5    4316
4    4832
Name: Staff, dtype: int64

No problems with this variable.

In [27]:
df['OnlineBooking'].value_counts(ascending = True)

0       2
1    1664
2    2391
3    2779
5    4054
4    4696
Name: OnlineBooking, dtype: int64

No problems with this variable.

In [28]:
df['PriceQuality'].value_counts(ascending = True)

1    1610
2    2005
3    3345
5    3762
4    4864
Name: PriceQuality, dtype: int64

No problems with this variable.

In [29]:
df['RoomSpace'].value_counts(ascending = True)

0      46
1    1386
2    2624
3    2701
5    4044
4    4785
Name: RoomSpace, dtype: int64

No problems with this variable.

In [30]:
df['CheckOut'].value_counts(ascending = True)

1     971
2    1574
3    2947
5    4340
4    5754
Name: CheckOut, dtype: int64

No problems with this variable.

In [31]:
df['Checkin'].value_counts(ascending = True)

2    1850
1    1907
5    3221
3    4283
4    4325
Name: Checkin, dtype: int64

No problems with this variable.

In [32]:
df['Cleanliness'].value_counts(ascending = True)

1     962
2    1602
3    2944
5    4238
4    5840
Name: Cleanliness, dtype: int64

No problems with this variable.

In [33]:
df['BarService'].value_counts(ascending = True)

0       2
1    1845
2    2272
5    3591
3    3675
4    4201
Name: BarService, dtype: int64

No problems with this variable.

### 3. Data Transformation

In [34]:
df['Longevity'] = df['Longevity'].replace('y', 'yes')
df['Longevity'].value_counts()

yes    12712
no      2874
Name: Longevity, dtype: int64

The 167 'y' were transformed to 'yes'

In [35]:
df['Wifi'] = df['Wifi'].replace(6,df['Wifi'].value_counts().idxmax())
df['Wifi'].value_counts()

4    3739
5    3445
3    3347
2    3245
1    1792
0      18
Name: Wifi, dtype: int64

We decided to replace the 'Wifi' observations that have a value of 6 with the mode of all observations, since we are not sure if people wanted to give a rating of 5 or if they though if the rating scale was from 0 to 10.

In [36]:
from datetime import date
df['Age'] = date.today().year - df['Year_Birth'] # define a new variable called Age
df.drop('Year_Birth', axis = 1, inplace = True)
df

,Churn,Name,Longevity,TypeTravel,RoomType,RewardPoints,Comfort,ReceptionSchedule,FoodDrink,Location,...,Amenities,Staff,OnlineBooking,PriceQuality,RoomSpace,CheckOut,Checkin,Cleanliness,BarService,Age
BookingID,,,,,,,,,,,,,,,,,,,,,
0,churn,Ms. Nicole Clarke,yes,business,single,4907,3,4,1,4,...,3,4,3,3,3,3,4,3,4,48.0
1,nochurn,Mr. Jesse Scott,yes,business,single,6724,1,1,1,1,...,3,4,5,5,5,5,1,5,2,57.0
2,churn,Mr. Christopher Carter,yes,business,single,4365,3,3,3,3,...,4,4,3,3,2,3,2,3,1,49.0
3,nochurn,Ms. Jennifer Morgan,yes,leisure,double,3849,1,1,1,1,...,4,5,4,4,4,4,4,4,3,29.0
4,nochurn,Mr. Michael White,yes,business,single,5376,2,2,3,2,...,5,5,5,5,3,4,1,3,5,33.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15584,churn,Ms. Wendy Roberts,no,business,double,4968,2,0,2,2,...,2,4,3,4,5,1,3,4,3,34.0
15585,churn,Ms. Sonya Smith,no,business,double,4970,3,3,3,3,...,3,5,5,3,1,3,4,4,5,22.0
15586,nochurn,Mr. Maxwell Wright,yes,business,single,4046,1,1,1,1,...,4,5,4,4,4,4,5,4,4,58.0
15587,nochurn,Mr. Gregory Moran,yes,leisure,double,5155,4,3,4,4,...,4,5,5,2,5,4,3,4,5,30.0
15588,churn,Mr. Steven Mendez,yes,business,suite,5136,3,3,3,3,...,3,3,3,4,5,4,1,3,3,39.0

Create a new variable called 'Age' that consists of subtracting 2022 to the year of birth of each client. 
After computing this new variable we remove the 'Year_Birth' variable from the dataset.

#### 3.1 Create Dummy Variables

##### Gender

In [37]:
df['prefix'] = df['Name'].str[0:2]
df['Gender'] = np.where(df['prefix']!= 'Mr', '1', '0')
df.drop('prefix', axis = 1, inplace = True)
#for i in df['prefix']:
 #   if i == 'Ms':
  #      df['Gender'] = 1
   # else: 
    #    df['Gender'] = 0
df

,Churn,Name,Longevity,TypeTravel,RoomType,RewardPoints,Comfort,ReceptionSchedule,FoodDrink,Location,...,Staff,OnlineBooking,PriceQuality,RoomSpace,CheckOut,Checkin,Cleanliness,BarService,Age,Gender
BookingID,,,,,,,,,,,,,,,,,,,,,
0,churn,Ms. Nicole Clarke,yes,business,single,4907,3,4,1,4,...,4,3,3,3,3,4,3,4,48.0,1
1,nochurn,Mr. Jesse Scott,yes,business,single,6724,1,1,1,1,...,4,5,5,5,5,1,5,2,57.0,0
2,churn,Mr. Christopher Carter,yes,business,single,4365,3,3,3,3,...,4,3,3,2,3,2,3,1,49.0,0
3,nochurn,Ms. Jennifer Morgan,yes,leisure,double,3849,1,1,1,1,...,5,4,4,4,4,4,4,3,29.0,1
4,nochurn,Mr. Michael White,yes,business,single,5376,2,2,3,2,...,5,5,5,3,4,1,3,5,33.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15584,churn,Ms. Wendy Roberts,no,business,double,4968,2,0,2,2,...,4,3,4,5,1,3,4,3,34.0,1
15585,churn,Ms. Sonya Smith,no,business,double,4970,3,3,3,3,...,5,5,3,1,3,4,4,5,22.0,1
15586,nochurn,Mr. Maxwell Wright,yes,business,single,4046,1,1,1,1,...,5,4,4,4,4,5,4,4,58.0,0
15587,nochurn,Mr. Gregory Moran,yes,leisure,double,5155,4,3,4,4,...,5,5,2,5,4,3,4,5,30.0,0
15588,churn,Mr. Steven Mendez,yes,business,suite,5136,3,3,3,3,...,3,3,4,5,4,1,3,3,39.0,0

Generate the Gender variable using the prefix of the 'Name'.
Encode the Gender variable into a dummy variable. If the client is female 'Gender' = 1, if it is male 'Gender' = 0

##### Longevity

In [38]:
df['d_Longevity'] = np.where(df['Longevity'] != 'no', '1', '0')

Create a dummy variable for 'Longevity'. If 'Longevity' = 'yes' use dummy 1, if 'Longevity' = 'no' use dummy 0.

##### Churn

In [39]:
df['d_Churn'] = np.where(df['Churn'] != 'nochurn', '1', '0')

Create a dummy variable for 'Churn'. If 'Churn' = 'churn' use dummy 1, if 'Churn' = 'nochurn' use dummy 0.

##### Type Travel

In [40]:
df['d_TypeTravel'] = np.where(df['TypeTravel'] != 'leisure', '1', '0')

Create a dummy variable for 'TypeTravel'. If 'TypeTravel' = 'business' use dummy 1, if 'TypeTravel' = 'leisure' use dummy 0.

##### Room Type

In [41]:
df['d_Single'] = np.where(df['RoomType'] == 'single', '1', '0')
df['d_Double'] = np.where(df['RoomType'] != 'double', '1', '0')

Create two dummy variables for 'RoomType'. If 'd_Single' = 0 and 'd_Double' = 0 it means that the room is a suite.

In [42]:
df['Recomendation'] = df[['Comfort', 'ReceptionSchedule', 'FoodDrink', 'Location', 'Wifi', 'Amenities', 'Staff', 'OnlineBooking', 'PriceQuality', 'RoomSpace', 'CheckOut', 'Checkin', 'Cleanliness', 'BarService']].mean(axis = 1)
df

,Churn,Name,Longevity,TypeTravel,RoomType,RewardPoints,Comfort,ReceptionSchedule,FoodDrink,Location,...,Cleanliness,BarService,Age,Gender,d_Longevity,d_Churn,d_TypeTravel,d_Single,d_Double,Recomendation
BookingID,,,,,,,,,,,,,,,,,,,,,
0,churn,Ms. Nicole Clarke,yes,business,single,4907,3,4,1,4,...,3,4,48.0,1,1,1,1,1,1,3.285714
1,nochurn,Mr. Jesse Scott,yes,business,single,6724,1,1,1,1,...,5,2,57.0,0,1,0,1,1,1,3.142857
2,churn,Mr. Christopher Carter,yes,business,single,4365,3,3,3,3,...,3,1,49.0,0,1,1,1,1,1,2.714286
3,nochurn,Ms. Jennifer Morgan,yes,leisure,double,3849,1,1,1,1,...,4,3,29.0,1,1,0,0,0,0,3.142857
4,nochurn,Mr. Michael White,yes,business,single,5376,2,2,3,2,...,3,5,33.0,0,1,0,1,1,1,3.571429
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15584,churn,Ms. Wendy Roberts,no,business,double,4968,2,0,2,2,...,4,3,34.0,1,0,1,1,0,0,2.714286
15585,churn,Ms. Sonya Smith,no,business,double,4970,3,3,3,3,...,4,5,22.0,1,0,1,1,0,0,3.571429
15586,nochurn,Mr. Maxwell Wright,yes,business,single,4046,1,1,1,1,...,4,4,58.0,0,1,0,1,1,1,3.214286
15587,nochurn,Mr. Gregory Moran,yes,leisure,double,5155,4,3,4,4,...,4,5,30.0,0,1,0,0,0,0,4.071429
15588,churn,Mr. Steven Mendez,yes,business,suite,5136,3,3,3,3,...,3,3,39.0,0,1,1,1,0,1,3.142857

Create a new variable 'Recomendation' that is equal to the mean of all the surveys variables for each Booking ID.

In [43]:
df = df[['Name', 'Age', 'Gender', 'd_Longevity','d_Churn', 'd_Single', 'd_Double', 'RewardPoints', 'Recomendation',
               'Comfort', 'ReceptionSchedule', 'FoodDrink', 'Location', 'Wifi', 'Amenities', 'Staff', 'OnlineBooking',
               'PriceQuality', 'RoomSpace', 'CheckOut', 'Checkin', 'Cleanliness', 'BarService']]
df.head()

,Name,Age,Gender,d_Longevity,d_Churn,d_Single,d_Double,RewardPoints,Recomendation,Comfort,...,Wifi,Amenities,Staff,OnlineBooking,PriceQuality,RoomSpace,CheckOut,Checkin,Cleanliness,BarService
BookingID,,,,,,,,,,,,,,,,,,,,,
0,Ms. Nicole Clarke,48.0,1,1,1,1,1,4907,3.285714,3,...,4,3,4,3,3,3,3,4,3,4
1,Mr. Jesse Scott,57.0,0,1,0,1,1,6724,3.142857,1,...,5,3,4,5,5,5,5,1,5,2
2,Mr. Christopher Carter,49.0,0,1,1,1,1,4365,2.714286,3,...,1,4,4,3,3,2,3,2,3,1
3,Ms. Jennifer Morgan,29.0,1,1,0,0,0,3849,3.142857,1,...,4,4,5,4,4,4,4,4,4,3
4,Mr. Michael White,33.0,0,1,0,1,1,5376,3.571429,2,...,5,5,5,5,5,3,4,1,3,5

#### 3.2 Handling Missing Values

In [44]:
df.isna().sum()

Name                   0
Age                  195
Gender                 0
d_Longevity            0
d_Churn                0
d_Single               0
d_Double               0
RewardPoints           0
Recomendation          0
Comfort                0
ReceptionSchedule      0
FoodDrink              0
Location               0
Wifi                   0
Amenities              0
Staff                  0
OnlineBooking          0
PriceQuality           0
RoomSpace              0
CheckOut               0
Checkin                0
Cleanliness            0
BarService             0
dtype: int64

There are 195 missing values in 'Age' that must be handled. We are going to use KNN Imputer to complete this missing values in our dataset.

In [45]:
from sklearn.impute import KNNImputer

df_knn = df.drop(columns=["Name"])

imputer = KNNImputer(n_neighbors=2, weights="uniform")
imputed_matrix = imputer.fit_transform(df_knn)

df_v2 = pd.DataFrame(data=imputed_matrix, columns=df_knn.columns, index=df_knn.index)

In [46]:
df.loc[df['Age'].isna()]

,Name,Age,Gender,d_Longevity,d_Churn,d_Single,d_Double,RewardPoints,Recomendation,Comfort,...,Wifi,Amenities,Staff,OnlineBooking,PriceQuality,RoomSpace,CheckOut,Checkin,Cleanliness,BarService
BookingID,,,,,,,,,,,,,,,,,,,,,
27,Ms. Emily Thomas,NaN,1,1,0,0,0,4760,3.357143,0,...,5,0,3,5,4,4,5,4,4,5
126,Ms. Elizabeth Tyler,NaN,1,1,1,0,0,5151,2.428571,2,...,2,2,2,2,3,4,3,2,4,2
147,Ms. Elizabeth Santos,NaN,1,0,0,1,1,5370,3.357143,4,...,2,4,2,2,5,4,4,4,4,2
168,Ms. Elizabeth Lawson,NaN,1,1,0,1,1,3669,3.642857,1,...,5,5,5,5,4,5,5,4,4,5
170,Ms. Elizabeth Morgan,NaN,1,1,0,1,1,4593,3.000000,1,...,2,4,5,4,4,4,5,2,4,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15279,Ms. Elizabeth Williams,NaN,1,1,0,0,0,5769,2.071429,0,...,3,4,1,2,2,0,2,5,2,2
15302,Mr. Edward Randall,NaN,0,1,1,0,0,4196,3.285714,4,...,1,5,1,1,5,4,4,3,4,1
15388,Ms. Elizabeth Carrillo,NaN,1,1,0,1,1,6448,4.142857,3,...,4,5,4,5,5,5,5,3,5,5
15445,Ms. Elizabeth Wilson,NaN,1,1,0,1,1,5438,4.500000,4,...,5,5,5,5,4,4,5,4,4,5
15568,Ms. Elizabeth Barker,NaN,1,0,1,1,1,4998,3.000000,1,...,5,1,5,5,1,2,3,2,3,5

In [47]:
df_v2.loc[df_v2['Age'].isna()]

Empty DataFrame
Columns: [Age, Gender, d_Longevity, d_Churn, d_Single, d_Double, RewardPoints, Recomendation, Comfort, ReceptionSchedule, FoodDrink, Location, Wifi, Amenities, Staff, OnlineBooking, PriceQuality, RoomSpace, CheckOut, Checkin, Cleanliness, BarService]
Index: []

[0 rows x 22 columns]

We no longer have NaN values in our dataset.

In [50]:
df_v2['Age'] = df_v2['Age'].round(decimals = 0)
df_v2.head()

,Age,Gender,d_Longevity,d_Churn,d_Single,d_Double,RewardPoints,Recomendation,Comfort,ReceptionSchedule,...,Wifi,Amenities,Staff,OnlineBooking,PriceQuality,RoomSpace,CheckOut,Checkin,Cleanliness,BarService
BookingID,,,,,,,,,,,,,,,,,,,,,
0,48.0,1.0,1.0,1.0,1.0,1.0,4907.0,3.285714,3.0,4.0,...,4.0,3.0,4.0,3.0,3.0,3.0,3.0,4.0,3.0,4.0
1,57.0,0.0,1.0,0.0,1.0,1.0,6724.0,3.142857,1.0,1.0,...,5.0,3.0,4.0,5.0,5.0,5.0,5.0,1.0,5.0,2.0
2,49.0,0.0,1.0,1.0,1.0,1.0,4365.0,2.714286,3.0,3.0,...,1.0,4.0,4.0,3.0,3.0,2.0,3.0,2.0,3.0,1.0
3,29.0,1.0,1.0,0.0,0.0,0.0,3849.0,3.142857,1.0,1.0,...,4.0,4.0,5.0,4.0,4.0,4.0,4.0,4.0,4.0,3.0
4,33.0,0.0,1.0,0.0,1.0,1.0,5376.0,3.571429,2.0,2.0,...,5.0,5.0,5.0,5.0,5.0,3.0,4.0,1.0,3.0,5.0

Rounding the 'Age' variable because some values that were imputed with KNN Imputer had decimal values.

data_cleaned.loc[data_cleaned['Age'] <= 15, ['Age']] = np.nan